In [1]:
import pandas as pd 
import numpy as np

In [2]:
schools_csv='/Users/sabalemma/Python/Resources/schools.csv'
students_csv='/Users/sabalemma/Python/Resources/students.csv'

In [57]:
schools_df=pd.read_csv(schools_csv)
students_df=pd.read_csv(students_csv)
schools_df.head()

   School ID                 school      type  size   budget
0          0      Huang High School  District  2917  1910635
1          1   Figueroa High School  District  2949  1884411
2          2    Shelton High School   Charter  1761  1056600
3          3  Hernandez High School  District  4635  3022020
4          4    Griffin High School   Charter  1468   917500

In [59]:
students_df.head()

,Student ID,name,gender,grade,school,reading_score,math_score
0,0,Paul Bradley,M,9th,Huang High School,66,79
1,1,Victor Smith,M,12th,Huang High School,94,61
2,2,Kevin Rodriguez,M,12th,Huang High School,90,60
3,3,Dr. Richard Scott,M,12th,Huang High School,67,58
4,4,Bonnie Ray,F,9th,Huang High School,97,84

In [5]:
schostu_df=pd.merge(students_df,schools_df,on='school')
schostu_df.head()

,Student ID,name,gender,grade,school,reading_score,math_score,School ID,type,size,budget
0,0,Paul Bradley,M,9th,Huang High School,66,79,0,District,2917,1910635
1,1,Victor Smith,M,12th,Huang High School,94,61,0,District,2917,1910635
2,2,Kevin Rodriguez,M,12th,Huang High School,90,60,0,District,2917,1910635
3,3,Dr. Richard Scott,M,12th,Huang High School,67,58,0,District,2917,1910635
4,4,Bonnie Ray,F,9th,Huang High School,97,84,0,District,2917,1910635

In [22]:
total_schools=schools_df['school'].count()
total_schools

15

In [24]:
total_students=students_df['name'].count()
total_students

39170

In [32]:
total_budget=schostu_df['budget'].sum()
total_budget

82932329558

In [41]:
average_math_score=schostu_df['math_score'].mean()
average_math_score

78.98537145774827

In [44]:
average_reading_score=schostu_df['reading_score'].mean()
average_reading_score

81.87784018381414

In [65]:
count_passing_math = schostu_df[schostu_df['math_score'] > 60].count()['math_score']
count_passing_math

35608

In [66]:
count_passing_reading = schostu_df[schostu_df['reading_score'] > 60].count()['reading_score']
count_passing_reading

39170

In [68]:
percentage_math=(count_passing_math/total_students)*100
percentage_math

90.90630584631096

In [69]:
percentage_reading=(count_passing_reading/total_students)*100
percentage_reading

100.0

In [72]:
overall_rate=(average_reading_score+average_math_score)/2
overall_rate

80.43160582078121

In [84]:
summary_df=pd.DataFrame({'Total Schools':[total_schools],'total Students':[total_students], 'Total Budget':[total_budget],
                       'Average Math Score':[average_math_score],'Average Reading Score':[average_reading_score], '%Passed Math'
                       :[percentage_math],'%Passed Reading':[percentage_reading],'Overall Passing Rate':[overall_rate]})
summary_df

,%Passed Math,%Passed Reading,Average Math Score,Average Reading Score,Overall Passing Rate,Total Budget,Total Schools,total Students
0,90.906306,100.0,78.985371,81.87784,80.431606,82932329558,15,39170

In [122]:
grouped_schools_df=schostu_df.groupby(['school'])
print(grouped_schools_df)
grouped_schools_df.count().head()

<pandas.core.groupby.DataFrameGroupBy object at 0x113d04128>

,Student ID,name,gender,grade,reading_score,math_score,School ID,type,size,budget
school,,,,,,,,,,
Bailey High School,4976,4976,4976,4976,4976,4976,4976,4976,4976,4976
Cabrera High School,1858,1858,1858,1858,1858,1858,1858,1858,1858,1858
Figueroa High School,2949,2949,2949,2949,2949,2949,2949,2949,2949,2949
Ford High School,2739,2739,2739,2739,2739,2739,2739,2739,2739,2739
Griffin High School,1468,1468,1468,1468,1468,1468,1468,1468,1468,1468

In [128]:
ave_reading_perschool_df=grouped_schools_df['reading_score'].mean()
ave_reading_perschool_df

school
Bailey High School       81.033963
Cabrera High School      83.975780
Figueroa High School     81.158020
Ford High School         80.746258
Griffin High School      83.816757
Hernandez High School    80.934412
Holden High School       83.814988
Huang High School        81.182722
Johnson High School      80.966394
Pena High School         84.044699
Rodriguez High School    80.744686
Shelton High School      83.725724
Thomas High School       83.848930
Wilson High School       83.989488
Wright High School       83.955000
Name: reading_score, dtype: float64

In [129]:
ave_math_perschool_df=grouped_schools_df['math_score'].mean()
ave_math_perschool_df

school
Bailey High School       77.048432
Cabrera High School      83.061895
Figueroa High School     76.711767
Ford High School         77.102592
Griffin High School      83.351499
Hernandez High School    77.289752
Holden High School       83.803279
Huang High School        76.629414
Johnson High School      77.072464
Pena High School         83.839917
Rodriguez High School    76.842711
Shelton High School      83.359455
Thomas High School       83.418349
Wilson High School       83.274201
Wright High School       83.682222
Name: math_score, dtype: float64